In [2]:
import pandas as pd

In [ ]:
df1 = pd.read_csv('employees.csv')
df2 = pd.read_csv('salaries.csv')

df_merge = pd.merge(df1, df2)

Exercises with Joins:
Inner Join: Join employees.csv with salaries.csv on EmployeeID to get the salary details for each employee.
Left Join: Join employees.csv with departments.csv on Department to get the department manager for each employee.
Right Join: Join employees.csv with projects.csv on EmployeeID to get the projects assigned to employees, including those with no project.
Full Outer Join: Join salaries.csv with locations.csv on EmployeeID to get salary and location for all employees, even if some information is missing in one of the tables.
Self Join: Join employees.csv with itself based on Department to get the list of employees in the same department as a specific employee.

Exercise 1-20:
1. Load a CSV file into a pandas DataFrame.
2. Check the first 5 rows of the DataFrame.
3. Get the shape of the DataFrame (rows, columns).
4. Get summary statistics (mean, median, mode, std) of numerical columns.
5. Get the data types of each column.
6. Check for missing values in each column.
7. Rename a column in the DataFrame.
8. Filter the DataFrame to get rows where a column value is greater than a certain number.
9. Select specific columns from the DataFrame.
10. Drop a column from the DataFrame.
11. Apply a transformation to a column (e.g., multiply each value by 2).
12. Add a new column based on an operation on existing columns.
13. Group the data by a categorical column and get the mean of each group.
14. Sort the DataFrame based on a specific column.
15. Merge two DataFrames on a common column.
16. Join two DataFrames using an index.
17. Apply a function to each element in a column using .apply().
18. Create a new DataFrame by filtering rows based on multiple conditions.
19. Convert a column from string to a numeric type.
20. Save the modified DataFrame to a new CSV file.

1. Load a CSV file into a pandas DataFrame.

In [3]:
df_employees = pd.read_csv('csv_files/employees.csv')
df_salaries = pd.read_csv('csv_files/salaries.csv')
df_departments = pd.read_csv('csv_files/departments.csv')
df_locations = pd.read_csv('csv_files/locations.csv')
df_projects = pd.read_csv('csv_files/projects.csv')

2. Check the first 5 rows of the DataFrame.

In [5]:
df_employees.head(5)

   EmployeeID   Name   Department  Salary
0           1   John  Engineering   55000
1           2   Anna    Marketing   46000
2           3  Peter  Engineering   60000
3           4  Linda           HR   75000
4           5  James    Marketing   49000

3. Get the shape of the DataFrame (rows, columns).

In [7]:
df_employees.shape

(10, 4)

In [9]:
df_employees.shape[1]

4

4. Get summary statistics (mean, median, mode, std) of numerical columns.

In [22]:
print("Mean ",df_employees[['Salary']].mean())
print("Median ",df_employees[['Salary']].median())
print("Mode ",df_employees['Salary'].mode())
print("Std ",df_employees[['Salary']].std())

Mean  Salary    61900.0
dtype: float64
Median  Salary    57500.0
dtype: float64
Mode  0    43000
1    46000
2    49000
3    52000
4    55000
5    60000
6    67000
7    75000
8    82000
9    90000
Name: Salary, dtype: int64
Std  Salary    16044.729145
dtype: float64

In [32]:
df_employees.describe()

       EmployeeID        Salary
count    10.00000     10.000000
mean      5.50000  61900.000000
std       3.02765  16044.729145
min       1.00000  43000.000000
25%       3.25000  49750.000000
50%       5.50000  57500.000000
75%       7.75000  73000.000000
max      10.00000  90000.000000

5. Get the data types of each column.

In [28]:
print(df_employees.dtypes)
print(df_departments.dtypes)
print(df_locations.dtypes)
print(df_projects.dtypes)
print(df_salaries.dtypes)

EmployeeID     int64
Name          object
Department    object
Salary         int64
dtype: object
DepartmentID     int64
Department      object
Manager         object
dtype: object
EmployeeID     int64
Location      object
dtype: object
ProjectID       int64
EmployeeID      int64
ProjectName    object
dtype: object
EmployeeID    int64
Salary        int64
Bonus         int64
dtype: object

6. Check for missing values in each column.

In [37]:
print(df_employees.isnull().sum())
print(df_departments.isnull().sum())
print(df_locations.isnull().sum())
print(df_projects.isnull().sum())
print(df_departments.isnull().sum())

EmployeeID    0
Name          0
Department    0
Salary        0
dtype: int64
DepartmentID    0
Department      0
Manager         0
dtype: int64
EmployeeID    0
Location      0
dtype: int64
ProjectID      0
EmployeeID     0
ProjectName    0
dtype: int64
DepartmentID    0
Department      0
Manager         0
dtype: int64

7. Rename a column in the DataFrame

In [64]:
df_employees.rename(columns={'EmployeeID': 'EmpID'}, inplace=True)
print (df_employees)

   EmpID       Name   Department  Salary
0      1       John  Engineering   55000
1      2       Anna    Marketing   46000
2      3      Peter  Engineering   60000
3      4      Linda           HR   75000
4      5      James    Marketing   49000
5      6   Patricia  Engineering   52000
6      7    Michael           HR   82000
7      8  Elizabeth  Engineering   67000
8      9      David    Marketing   43000
9     10      Susan           HR   90000

In [65]:
df_employees.columns = ['EmployeeID', 'Name', 'Dept', 'Salary']
print (df_employees)

   EmployeeID       Name         Dept  Salary
0           1       John  Engineering   55000
1           2       Anna    Marketing   46000
2           3      Peter  Engineering   60000
3           4      Linda           HR   75000
4           5      James    Marketing   49000
5           6   Patricia  Engineering   52000
6           7    Michael           HR   82000
7           8  Elizabeth  Engineering   67000
8           9      David    Marketing   43000
9          10      Susan           HR   90000

8. Filter the DataFrame to get rows where a column value is greater than a certain number.

In [66]:
df_employees[df_employees['Salary'] > 60000]

   EmployeeID       Name         Dept  Salary
3           4      Linda           HR   75000
6           7    Michael           HR   82000
7           8  Elizabeth  Engineering   67000
9          10      Susan           HR   90000

9. Select specific columns from the DataFrame.

In [69]:
df_employees[['EmployeeID', 'Salary']]

   EmployeeID  Salary
0           1   55000
1           2   46000
2           3   60000
3           4   75000
4           5   49000
5           6   52000
6           7   82000
7           8   67000
8           9   43000
9          10   90000

10. Drop a column from the DataFrame.

In [ ]:
df_projects.drop('ProjectName', axis=1)

   ProjectID  EmployeeID
0        101           1
1        102           2
2        103           3
3        104           4
4        105           5
5        106           6
6        107           7
7        108           8
8        109           9
9        110          10

In [80]:
df_projects

   ProjectID  EmployeeID      ProjectName
0        101           1    Project Alpha
1        102           2     Project Beta
2        103           3    Project Gamma
3        104           4    Project Delta
4        105           5  Project Epsilon
5        106           6     Project Zeta
6        107           7      Project Eta
7        108           8    Project Theta
8        109           9     Project Iota
9        110          10    Project Kappa

11. Apply a transformation to a column (e.g., multiply each value by 2).

In [ ]:
temp = df_employees.copy()
#temp['Salary'] = df_employees['Salary'].apply(lambda x: x * 2)

temp['Salary'] = temp['Salary']*2
temp

   EmployeeID       Name   Department  Salary
0           1       John  Engineering  110000
1           2       Anna    Marketing   92000
2           3      Peter  Engineering  120000
3           4      Linda           HR  150000
4           5      James    Marketing   98000
5           6   Patricia  Engineering  104000
6           7    Michael           HR  164000
7           8  Elizabeth  Engineering  134000
8           9      David    Marketing   86000
9          10      Susan           HR  180000

In [106]:
df_employees

   EmployeeID       Name   Department  Salary
0           1       John  Engineering   55000
1           2       Anna    Marketing   46000
2           3      Peter  Engineering   60000
3           4      Linda           HR   75000
4           5      James    Marketing   49000
5           6   Patricia  Engineering   52000
6           7    Michael           HR   82000
7           8  Elizabeth  Engineering   67000
8           9      David    Marketing   43000
9          10      Susan           HR   90000

12. Add a new column based on an operation on existing columns.

In [107]:
df_employees['Salary_After_Tax'] = df_employees['Salary'] * 0.825
df_employees

   EmployeeID       Name   Department  Salary  Salary_After_Tax
0           1       John  Engineering   55000           45375.0
1           2       Anna    Marketing   46000           37950.0
2           3      Peter  Engineering   60000           49500.0
3           4      Linda           HR   75000           61875.0
4           5      James    Marketing   49000           40425.0
5           6   Patricia  Engineering   52000           42900.0
6           7    Michael           HR   82000           67650.0
7           8  Elizabeth  Engineering   67000           55275.0
8           9      David    Marketing   43000           35475.0
9          10      Susan           HR   90000           74250.0

In [108]:
df_employees

   EmployeeID       Name   Department  Salary  Salary_After_Tax
0           1       John  Engineering   55000           45375.0
1           2       Anna    Marketing   46000           37950.0
2           3      Peter  Engineering   60000           49500.0
3           4      Linda           HR   75000           61875.0
4           5      James    Marketing   49000           40425.0
5           6   Patricia  Engineering   52000           42900.0
6           7    Michael           HR   82000           67650.0
7           8  Elizabeth  Engineering   67000           55275.0
8           9      David    Marketing   43000           35475.0
9          10      Susan           HR   90000           74250.0

13. Group the data by a categorical column and get the mean of each group.

In [114]:
print(df_employees.groupby('Department')['Salary'].mean())

Department
Engineering    58500.000000
HR             82333.333333
Marketing      46000.000000
Name: Salary, dtype: float64

14. Sort the DataFrame based on a specific column.

In [116]:
df_employees.sort_values(by='Name')

   EmployeeID       Name   Department  Salary  Salary_After_Tax
1           2       Anna    Marketing   46000           37950.0
8           9      David    Marketing   43000           35475.0
7           8  Elizabeth  Engineering   67000           55275.0
4           5      James    Marketing   49000           40425.0
0           1       John  Engineering   55000           45375.0
3           4      Linda           HR   75000           61875.0
6           7    Michael           HR   82000           67650.0
5           6   Patricia  Engineering   52000           42900.0
2           3      Peter  Engineering   60000           49500.0
9          10      Susan           HR   90000           74250.0

15. Merge two DataFrames on a common column.

In [130]:
df_employees.merge(df_departments, on='Department')

,Name,Department,Salary,Salary_After_Tax,DepartmentID,Manager
0,John,Engineering,55000,45375.0,1,John Doe
1,Anna,Marketing,46000,37950.0,2,Jane Smith
2,Peter,Engineering,60000,49500.0,1,John Doe
3,Linda,HR,75000,61875.0,3,Michael Brown
4,James,Marketing,49000,40425.0,2,Jane Smith
5,Patricia,Engineering,52000,42900.0,1,John Doe
6,Michael,HR,82000,67650.0,3,Michael Brown
7,Elizabeth,Engineering,67000,55275.0,1,John Doe
8,David,Marketing,43000,35475.0,2,Jane Smith
9,Susan,HR,90000,74250.0,3,Michael Brown

In [133]:
df_employees

   EmployeeID       Name   Department  Salary
0           1       John  Engineering   55000
1           2       Anna    Marketing   46000
2           3      Peter  Engineering   60000
3           4      Linda           HR   75000
4           5      James    Marketing   49000
5           6   Patricia  Engineering   52000
6           7    Michael           HR   82000
7           8  Elizabeth  Engineering   67000
8           9      David    Marketing   43000
9          10      Susan           HR   90000

16. Join two DataFrames using an index.

In [134]:
df_employees.merge(df_departments, on='Department').set_index('EmployeeID')

                 Name   Department  Salary  DepartmentID        Manager
EmployeeID
1                John  Engineering   55000             1       John Doe
2                Anna    Marketing   46000             2     Jane Smith
3               Peter  Engineering   60000             1       John Doe
4               Linda           HR   75000             3  Michael Brown
5               James    Marketing   49000             2     Jane Smith
6            Patricia  Engineering   52000             1       John Doe
7             Michael           HR   82000             3  Michael Brown
8           Elizabeth  Engineering   67000             1       John Doe
9               David    Marketing   43000             2     Jane Smith
10              Susan           HR   90000             3  Michael Brown

17. Apply a function to each element in a column using .apply().

In [137]:
df_employees['SalaryAfterTax'] = df_employees['Salary'].apply(lambda x: x * 0.825)
df_employees

   EmployeeID       Name   Department  Salary  SalaryAfterTax
0           1       John  Engineering   55000         45375.0
1           2       Anna    Marketing   46000         37950.0
2           3      Peter  Engineering   60000         49500.0
3           4      Linda           HR   75000         61875.0
4           5      James    Marketing   49000         40425.0
5           6   Patricia  Engineering   52000         42900.0
6           7    Michael           HR   82000         67650.0
7           8  Elizabeth  Engineering   67000         55275.0
8           9      David    Marketing   43000         35475.0
9          10      Susan           HR   90000         74250.0

18. Create a new DataFrame by filtering rows based on multiple conditions.

In [140]:
FwmC = df_employees[(df_employees['Salary'] > 60000) & (df_employees['Department'] == 'HR')]
FwmC

   EmployeeID     Name Department  Salary  SalaryAfterTax
3           4    Linda         HR   75000         61875.0
6           7  Michael         HR   82000         67650.0
9          10    Susan         HR   90000         74250.0

19. Convert a column from string to a numeric type.

In [143]:
df_employees['EmployeeID'] = df_employees['EmployeeID'].astype(str)
df_employees.dtypes

EmployeeID         object
Name               object
Department         object
Salary              int64
SalaryAfterTax    float64
dtype: object

In [145]:
df_employees['EmployeeID'] = df_employees['EmployeeID'].astype(int)
df_employees.dtypes

EmployeeID          int64
Name               object
Department         object
Salary              int64
SalaryAfterTax    float64
dtype: object

In [148]:
df_employees.to_csv('syed_file.csv', index=False)

2nd Week Friday Presentation

In [4]:
for i in range (1, 6):
    print (f"{i:<5} {i**2:<5} {i**3:<5}")

1     1     1
2     4     8
3     9     27
4     16    64
5     25    125

In [5]:
name = input("Enter your name: ")
print ("Hello", name)

Hello syed

In [6]:
print("Hello World")

Hello World

In [10]:
a = int(input("Enter first number: "))
b = int(input("Enter second number: "))
print ("Sum is :", a + b)

Sum is : 9

In [11]:
name = "syed"
age = 25
print (f"Hello {name}, you are {age} years old.")
print ("Hello {0}, you are {1} years old.".format(name, age))

Hello syed, you are 25 years old.
Hello syed, you are 25 years old.

In [13]:
pi = 3.14159
radius = 5
print (f"Pi value rounded to 2 decimal places is {pi:.2f}")
print (f"Area of circle with radius {radius} is {pi * radius ** 2:.2f}")

Pi value rounded to 2 decimal places is 3.14
Area of circle with radius 5 is 78.54

In [14]:
for i in range(1, 11):
    print (f"{i:<5} {i**2:<5} {i**3:<5}")

1     1     1
2     4     8
3     9     27
4     16    64
5     25    125
6     36    216
7     49    343
8     64    512
9     81    729
10    100   1000

In [15]:
number = 1234567.8912
print(f"{number:,.2f}")

1,234,567.89

In [18]:
print ("{:<10} | {:^10} | {:>10}".format("left", "center", "right"))

left       |   center   |      right

In [20]:
person = {"name": "syed", "age": 25}
print (f"Hello {person['name']}, you are {person['age']} years old.")

Hello syed, you are 25 years old.

In [21]:
class person:
    def __init__(self, name, age):
        self.name = name
        self.age = age

    def greet(self):
        print(f"Hello {self.name}, you are {self.age} years old.")

In [24]:
from tabulate import tabulate
data = [["syed", 25], ["john", 30], ["jane", 28]]
print(data)

[['syed', 25], ['john', 30], ['jane', 28]]

In [25]:
print(tabulate(data, headers=["Name", "Age"], tablefmt="grid"))

+--------+-------+
| Name   |   Age |
+========+=======+
| syed   |    25 |
+--------+-------+
| john   |    30 |
+--------+-------+
| jane   |    28 |
+--------+-------+

In [28]:
import textwrap

In [29]:
textwrap.fill("Hello World! This is a long string that needs to be wrapped.", width=20)

'Hello World! This is\na long string that\nneeds to be wrapped.'

In [32]:
print("That was funny event: ",'\U0001F600')

That was funny event:

In [35]:
print("\033[91m" + "Hello World!" + "\033[0m")
print("\033[92m" + "Hello World!" + "\033[0m")
print("\033[1m" + "Hello World!" + "\033[0m")
print("\033[0m" + "Hello World!" + "\033[0m")

Hello World!
Hello World!
Hello World!
Hello World!